// типы данных
// String- тип данных для текста
// Number- тип данных для чисел
// Boolean - тип данных для логический значений(true/false)
// null - специальное значение которое означает "отсутствие значения"
// undefined - тип данных который означает что переменная не была инициализирована
// Object - тип данных для обЪектов, которые могут содержать свойства и методы 
// BigInt - тип дпнных для больших целых чисел
// Symbol - тип данных для уникальных идентификатаров


let str ="hello";
console.log(typeof str);

let a =42;
console.log(typeof a);

let b ="12234567890"
console.log(typeof b);



// условные операторы
// if(условие){
    // код который выполнится, если условые истинно 
// } else {
    //  код, который выполнится, если условые ложно
// }


// let number = Number(prompt("введите число:"));

// if (number % 2 ===0) {
//   alert("Число четное");
// } else {
//   alert("число нечетное");
// }



// ---------------------------------------------

// let age = prompt("Введите ваш возрост");
// if(age <= 15 ){
//     alert("Салам кичи айым")
// }else if( age <= 15 && age <= 30){
//     alert("Салам сулуу")
// }else if(age <= 30 ){
//     alert("Салам сулуу")
// }else if( age <= 30 && age <= 50){
//     alert("Салам айым")
// else if(age <= 50 ){
//     alert("Салам айым")
// }else if( age <= 50 && age <= 70){
//     alert("Салам апа")
// else if(age <= 70 ){
//     alert("Салам апа")
// }else if( age <= 70 && age <= 100){
//     alert("Салам чон апа")
// }



